app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `email` = 'admin@mail.com'
OR `no_telp` = 'admin@mail.com'
 LIMIT 1
---
    public function loginCheck()
    {
        if ($this->request->getMethod() == 'POST') {
            $rules = [
                'loginInput' => [
                    'rules' => 'required',
                    'errors' => [
                        'required' => 'Masukan email atau no. telp'
                    ]
                ],

                'password' => [
                    'rules' => 'required',
                    'errors' => [
                        'required' => 'Password harus diisi'
                    ]
                ]
            ];

            if ($this->validate($rules)) {

                $loginInput = $this->request->getVar('loginInput');
                $password = $this->request->getVar('password');

                $user = $this->userModel
                    ->where('email', $loginInput)
                    ->orWhere('no_telp', $loginInput)
                    ->first();

INSERT INTO `user` (`email`, `password`, `nama`, `no_telp`) VALUES ('admin1@mail.com', '$2y$10$VnB.89ClmZMuVkcJ0bH3l.vwG5jZZzr8EOmUIWTwA6uE5xrt10hlK', 'denny', '085155062088')
---
                    'no_telp' => $no_telp,
                ];

                if ($this->userModel->insert($data)) {