app/Controllers/DataMasterController.php

    public function index_lokasi()
    {
        $data = [
            'title' => 'Data Master - Location',
            'lokasi' => $this->lokasiModel->findAll(),
---
SELECT *
FROM `lokasi`

    public function create_lokasi()
    {
        if ($this->request->getMethod() == 'POST') {
            $rules = [
                'nama' => [
                    'rules' => 'required',
                    'errors' => [
                        'required' => 'Nama harus diisi.'
                    ]
                ],

                'kode_zip' => [
                    'rules' => 'required',
                    'errors' => [
                        'required' => 'Kode Zip harus diisi.'
                    ]
                ],
            ];
            if ($this->validate($rules)) {
                $data = [
                    'nama' => $this->request->getPost('nama'),
                    'kode_zip' => $this->request->getPost('kode_zip'),
                ];

                if ($this->lokasiModel->insert($data)) {
---
INSERT INTO `lokasi` (`nama`, `kode_zip`) VALUES ('Denny Fadilah', '11260')

    public function delete_lokasi($id)
    {
        $this->lokasiModel->delete($id);
---
DELETE FROM `lokasi`
WHERE `id` IN ('1')