app/Controllers/VerificationController.php

SELECT *
FROM `user`
WHERE `email` = 'dennyfadilah08@gmail.com'
 LIMIT 1
---
    public function sendVerificationCode()
    {
        // Ambil email dari input
        $email = $this->request->getPost('email');

        // Validasi email
        if (!filter_var($email, FILTER_VALIDATE_EMAIL)) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Email tidak valid.']);
        }

        // Cek apakah email sudah terdaftar
        $user = $this->userModel->where('email', $email)->first();